# HeightOfRunIsTooSmall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..HeightOfRunIsTooSmall Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Height of run is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HeightOfRunIsTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HeightOfRunIsTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HeightOfRunIsTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace